I-SYST/EHAL/ARM/Nordic/src/ble_app_nrf52.cpp
//    printf("evt %d\r\n", p_ble_evt->header.evt_id);

   // ble_conn_state_on_ble_evt(p_ble_evt);

    if ((role == BLE_GAP_ROLE_CENTRAL) || (p_ble_evt->header.evt_id == BLE_GAP_EVT_ADV_REPORT) || g_BleAppData.AppRole & BLEAPP_ROLE_CENTRAL)
    {
        BleCentralEvtUserHandler((ble_evt_t *)p_ble_evt);
    }
    else
    {
//        pm_on_ble_evt(p_ble_evt);
        //ble_advertising_on_ble_evt(p_ble_evt);
//        ble_conn_params_on_ble_evt(p_ble_evt, p_context);
        BlePeriphEvtUserHandler((ble_evt_t *)p_ble_evt);
    }
    on_ble_evt(p_ble_evt);
    ble_db_discovery_on_ble_evt(p_ble_evt, p_context);
}

/**@brief Function for the Peer Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Peer Manager.
 */
static void BleAppPeerMngrInit(BLEAPP_SECTYPE SecType, uint8_t SecKeyExchg, bool bEraseBond)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    if (bEraseBond)
    {
        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
    }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    sec_param.bond = 1;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
	sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    switch (SecType)
    {
    	case BLEAPP_SECTYPE_NONE:
			break;
		case BLEAPP_SECTYPE_STATICKEY_NO_MITM:
			break;
		case BLEAPP_SECTYPE_STATICKEY_MITM:
			sec_param.mitm = 1;
			break;
		case BLEAPP_SECTYPE_LESC_MITM:
		case BLEAPP_SECTYPE_SIGNED_MITM:
			sec_param.mitm = 1;
		    sec_param.lesc = 1;
			break;
		case BLEAPP_SECTYPE_SIGNED_NO_MITM:
		    sec_param.lesc = 1;
			break;
    }

/*    if (SecType == BLEAPP_SECTYPE_STATICKEY_MITM ||
    	SecType == BLEAPP_SECTYPE_LESC_MITM ||
		SecType == BLEAPP_SECTYPE_SIGNED_MITM)
    {
    	sec_param.mitm = 1;
    }
*/
    int type = SecKeyExchg & (BLEAPP_SECEXCHG_KEYBOARD | BLEAPP_SECEXCHG_DISPLAY);
    switch (type)
    {
		case BLEAPP_SECEXCHG_KEYBOARD:
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;

		case BLEAPP_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
    			break;
		case (BLEAPP_SECEXCHG_KEYBOARD | BLEAPP_SECEXCHG_DISPLAY):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
    }

    if (SecKeyExchg & BLEAPP_SECEXCHG_OOB)
    {
    		sec_param.oob = 1;
    }

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Generate the ECDH key pair and set public key in the peer-manager.
    err_code = ble_lesc_ecc_keypair_generate_and_set();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Security Request timer timeout.
 *
 * @details This function will be called each time the Security Request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t err_code;

    if (g_BleAppData.ConnHdl != BLE_CONN_HANDLE_INVALID)
    {
        // Initiate bonding.
        //NRF_LOG_DEBUG("Start encryption\r\n");
        err_code = pm_conn_secure(g_BleAppData.ConnHdl, false);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

void BleAppAdvManDataSet(uint8_t *pData, int Len)
{
   int l = min(Len, BLE_GAP_ADV_SET_DATA_SIZE_MAX);

   memcpy(g_BleAppData.ManufData.data.p_data, pData, l);

   uint32_t err = ble_advdata_encode(&g_BleAppData.AdvData, g_AdvInstance.adv_data.adv_data.p_data, &g_AdvInstance.adv_data.adv_data.len);
   APP_ERROR_CHECK(err);

   // SDK15 doesn't allow dynamicaly updating adv data.  Have to stop and re-start advertising
   if (g_BleAppData.bAdvertising == true)
   {
	   sd_ble_gap_adv_stop(g_AdvInstance.adv_handle);
   }

   err = sd_ble_gap_adv_set_configure(&g_AdvInstance.adv_handle, &g_AdvInstance.adv_data, NULL);

   if (g_BleAppData.bAdvertising == true)
   {
	   BleAppAdvStart(BLEAPP_ADVMODE_FAST);
   }

#if 0
    int l = min(Len, BLE_GAP_ADV_MAX_SIZE);

    memcpy(g_AdvInstance.manuf_data_array, pData, l);
    uint32_t ret = ble_advdata_set(&(g_AdvInstance.advdata), &g_BleAppData.SRData);
#endif
}

void BleAppAdvStart(BLEAPP_ADVMODE AdvMode)
{
	g_BleAppData.bAdvertising = true;
	if (g_BleAppData.AppMode == BLEAPP_MODE_NOCONNECT)
	{
		uint32_t err_code = sd_ble_gap_adv_start(g_AdvInstance.adv_handle, BLEAPP_CONN_CFG_TAG);
        APP_ERROR_CHECK(err_code);
	}
	else
	{
		uint32_t err_code = ble_advertising_start(&g_AdvInstance, (ble_adv_mode_t)AdvMode);
	    APP_ERROR_CHECK(err_code);
	}
}

void BleAppAdvStop()
{
	sd_ble_gap_adv_stop(g_AdvInstance.adv_handle);
	g_BleAppData.bAdvertising = false;
}

/**@brief Overloadable function for initializing the Advertising functionality.
 */
__WEAK void BleAppAdvInit(const BLEAPP_CFG *pCfg)
{
    uint32_t               err_code;
//    ble_advdata_manuf_data_t mdata;
    ble_advertising_init_t	initdata;

    memset(&initdata, 0, sizeof(ble_advertising_init_t));

    g_BleAppData.ManufData.company_identifier = pCfg->VendorID;
    g_BleAppData.ManufData.data.p_data = (uint8_t*)pCfg->pManData;
    g_BleAppData.ManufData.data.size = pCfg->ManDataLen;

    // Build advertising data struct to pass into @ref ble_advertising_init.

    initdata.advdata.include_appearance = false;
    initdata.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    if (pCfg->pDevName != NULL)
    {
    	if (strlen(pCfg->pDevName) < 14)
    	{
    		initdata.advdata.name_type      = BLE_ADVDATA_SHORT_NAME;
    		initdata.advdata.short_name_len = strlen(pCfg->pDevName);
    	}
    	else
    		initdata.advdata.name_type = BLE_ADVDATA_FULL_NAME;
    }
    else
    {
    		initdata.advdata.name_type = BLE_ADVDATA_NO_NAME;
    }

    if (initdata.advdata.name_type == BLE_ADVDATA_NO_NAME)
    {
        if (pCfg->NbAdvUuid > 0 && pCfg->pAdvUuids != NULL)
        {
        		initdata.advdata.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
        		initdata.advdata.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;
			if (pCfg->pManData != NULL)
			{
				initdata.srdata.p_manuf_specific_data = &g_BleAppData.ManufData;
			}
        }
        else
        {
			if (pCfg->pManData != NULL)
			{
				initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;
			}
        }
    }
    else
    {
        if (pCfg->NbAdvUuid > 0 && pCfg->pAdvUuids != NULL)
        {
        		initdata.srdata.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
        		initdata.srdata.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;
        }
        if (pCfg->pManData != NULL)
        {
        		initdata.advdata.p_manuf_specific_data = &g_BleAppData.ManufData;
        }
    }

    if (pCfg->AppMode == BLEAPP_MODE_NOCONNECT || pCfg->AppMode == BLEAPP_MODE_IBEACON)
    {
//        err_code = ble_advdata_encode(&initdata.advdata, g_AdvData.adv_data.p_data, &g_AdvData.adv_data.len);
        g_AdvInstance.adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;
        g_AdvInstance.adv_data.adv_data.p_data = g_AdvInstance.enc_advdata;

        err_code = ble_advdata_encode(&initdata.advdata, g_AdvInstance.adv_data.adv_data.p_data, &g_AdvInstance.adv_data.adv_data.len);
        APP_ERROR_CHECK(err_code);

        //err_code = ble_advdata_set(&initdata.advdata, &initdata.srdata);
        //APP_ERROR_CHECK(err_code);

        // Initialize advertising parameters (used when starting advertising).
        memset(&g_AdvInstance.adv_params, 0, sizeof(g_AdvInstance.adv_params));


